In [1]:
import pandas as pd

In [3]:
# read the data from the csv file 
df=pd.read_csv("C:\\Users\\dell\\pandas\\employee_data.csv")
print(df)

    CID        NAME STATE DSG
0   100    VISHNAVI    TS  SE
1   200     MANJULA    AP  SE
2   300     BHUMIKA    TS  TL
3   400  LAXIMIDEVI  BANG  TL
4   500       SWATI    AP  PM
5   600     SHAKSHI  BANG  PM
6   700    BHARGAVI    TS  SE
7   800       UDAYA    AP  PM
8   900       SWETA  BANG  SE
9   750      ANJALI    AP  TL
10  650    JAYASREE  BANG  PM
11  550     SIRISHA    AP  HR
12  450     MADHAVI    TS  HR
13  350      AKHILA    AP  HR
14  150       RADHA  BANG  TL
15  950     MOUNIKA    AP  HR
16  125     FARHANA    TS  TL
17  185      JHANSI    AP  TL

In [7]:
gby=df.groupby("STATE")
print(type(gby))
print(gby)

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002360B242F90>

In [9]:
# get the group name and it details
for groupname,grouprecords in gby:
    print("*"*50)
    print("group name={}".format(groupname))
    print("*"*50)
    print(grouprecords)
    print("*"*50)

**************************************************
group name=AP
**************************************************
    CID     NAME STATE DSG
1   200  MANJULA    AP  SE
4   500    SWATI    AP  PM
7   800    UDAYA    AP  PM
9   750   ANJALI    AP  TL
11  550  SIRISHA    AP  HR
13  350   AKHILA    AP  HR
15  950  MOUNIKA    AP  HR
17  185   JHANSI    AP  TL
**************************************************
**************************************************
group name=BANG
**************************************************
    CID        NAME STATE DSG
3   400  LAXIMIDEVI  BANG  TL
5   600     SHAKSHI  BANG  PM
8   900       SWETA  BANG  SE
10  650    JAYASREE  BANG  PM
14  150       RADHA  BANG  TL
**************************************************
**************************************************
group name=TS
**************************************************
    CID      NAME STATE DSG
0   100  VISHNAVI    TS  SE
2   300   BHUMIKA    TS  TL
6   700  BHARGAVI    TS  SE
12  450   MADHAVI    TS  HR
16  125   FARHANA    TS  TL
**************************************************

In [11]:
# get the first record from the every grou
gby.first()

       CID        NAME DSG
STATE
AP     200     MANJULA  SE
BANG   400  LAXIMIDEVI  TL
TS     100    VISHNAVI  SE

In [13]:
# get the last record from every group
gby.last()

       CID     NAME DSG
STATE
AP     185   JHANSI  TL
BANG   150    RADHA  TL
TS     125  FARHANA  TL

In [15]:
# get the third record from the every group
gby.nth(2)

   CID      NAME STATE DSG
6  700  BHARGAVI    TS  SE
7  800     UDAYA    AP  PM
8  900     SWETA  BANG  SE

In [17]:
# get the size the dataframe groups
gby.size()

STATE
AP      8
BANG    5
TS      5
dtype: int64

In [19]:
len(gby)

3

In [21]:
# it is giving the number of groups

In [25]:
# get the group name and its details 
for groupname,grouprecords in df.groupby("STATE"):
    print("*"*50)
    print("Group Name=",groupname)
    print("*"*50)
    print(grouprecords)
    print("*"*50)

**************************************************
Group Name= AP
**************************************************
    CID     NAME STATE DSG
1   200  MANJULA    AP  SE
4   500    SWATI    AP  PM
7   800    UDAYA    AP  PM
9   750   ANJALI    AP  TL
11  550  SIRISHA    AP  HR
13  350   AKHILA    AP  HR
15  950  MOUNIKA    AP  HR
17  185   JHANSI    AP  TL
**************************************************
**************************************************
Group Name= BANG
**************************************************
    CID        NAME STATE DSG
3   400  LAXIMIDEVI  BANG  TL
5   600     SHAKSHI  BANG  PM
8   900       SWETA  BANG  SE
10  650    JAYASREE  BANG  PM
14  150       RADHA  BANG  TL
**************************************************
**************************************************
Group Name= TS
**************************************************
    CID      NAME STATE DSG
0   100  VISHNAVI    TS  SE
2   300   BHUMIKA    TS  TL
6   700  BHARGAVI    TS  SE
12  450   MADHAVI    TS  HR
16  125   FARHANA    TS  TL
**************************************************

In [27]:
# groupby with the DSG 
for groupname,grouprecords in df.groupby("DSG"):
    print("*"*50)
    print("Group Name=",groupname)
    print("*"*50)
    print(grouprecords)
    print("*"*50)

**************************************************
Group Name= HR
**************************************************
    CID     NAME STATE DSG
11  550  SIRISHA    AP  HR
12  450  MADHAVI    TS  HR
13  350   AKHILA    AP  HR
15  950  MOUNIKA    AP  HR
**************************************************
**************************************************
Group Name= PM
**************************************************
    CID      NAME STATE DSG
4   500     SWATI    AP  PM
5   600   SHAKSHI  BANG  PM
7   800     UDAYA    AP  PM
10  650  JAYASREE  BANG  PM
**************************************************
**************************************************
Group Name= SE
**************************************************
   CID      NAME STATE DSG
0  100  VISHNAVI    TS  SE
1  200   MANJULA    AP  SE
6  700  BHARGAVI    TS  SE
8  900     SWETA  BANG  SE
**************************************************
**************************************************
Group Name= TL
**************************************************
    CID        NAME STATE DSG
2   300     BHUMIKA    TS  TL
3   400  LAXIMIDEVI  BANG  TL
9   750      ANJALI    AP  TL
14  150       RADHA  BANG  TL
16  125     FARHANA    TS  TL
17  185      JHANSI    AP  TL
**************************************************

In [29]:
df.groupby("DSG").nunique()

     CID  NAME  STATE
DSG
HR     4     4      2
PM     4     4      2
SE     4     4      3
TL     6     6      3

In [31]:
# get the size of the datafrma groups on the bases of the DSG
df.groupby("DSG").size()

DSG
HR    4
PM    4
SE    4
TL    6
dtype: int64

In [33]:
# get the groupname and its details
for gbinfo in df.groupby("DSG"):
    print(type(gbinfo))

<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>

In [39]:
# get the groupname and its details
for gbinfo in df.groupby("DSG"):
    print(gbinfo[0])
    print(type(gbinfo[0]))

HR
<class 'str'>
PM
<class 'str'>
SE
<class 'str'>
TL
<class 'str'>

In [41]:
for gbinfo in df.groupby("DSG"):
    print(gbinfo[1])
    print(type(gbinfo[1]))

    CID     NAME STATE DSG
11  550  SIRISHA    AP  HR
12  450  MADHAVI    TS  HR
13  350   AKHILA    AP  HR
15  950  MOUNIKA    AP  HR
<class 'pandas.core.frame.DataFrame'>
    CID      NAME STATE DSG
4   500     SWATI    AP  PM
5   600   SHAKSHI  BANG  PM
7   800     UDAYA    AP  PM
10  650  JAYASREE  BANG  PM
<class 'pandas.core.frame.DataFrame'>
   CID      NAME STATE DSG
0  100  VISHNAVI    TS  SE
1  200   MANJULA    AP  SE
6  700  BHARGAVI    TS  SE
8  900     SWETA  BANG  SE
<class 'pandas.core.frame.DataFrame'>
    CID        NAME STATE DSG
2   300     BHUMIKA    TS  TL
3   400  LAXIMIDEVI  BANG  TL
9   750      ANJALI    AP  TL
14  150       RADHA  BANG  TL
16  125     FARHANA    TS  TL
17  185      JHANSI    AP  TL
<class 'pandas.core.frame.DataFrame'>

In [45]:
# get the group name and its size
for gbinfo in df.groupby("DSG"):
    print(gbinfo[0],"--->",len(gbinfo[1]))

HR ---> 4
PM ---> 4
SE ---> 4
TL ---> 6